; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite2 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	image1 - mode
	infrared2 - mode
	spectrograph0 - mode
	Star3 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star5 - direction
	Star7 - direction
	Star0 - direction
	GroundStation4 - direction
	Star6 - direction
	GroundStation8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star9)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star5)
	(supports instrument5 image1)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star0)
	(supports instrument6 image1)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star7)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 Star0)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument8 image1)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation8)
	(calibration_target instrument8 Star6)
	(supports instrument9 spectrograph0)
	(supports instrument9 image1)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star9)
	(supports instrument10 image1)
	(supports instrument10 spectrograph0)
	(supports instrument10 infrared2)
	(calibration_target instrument10 Star9)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(on_board instrument10 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet13)
)
(:goal (and
	(pointing satellite1 Star0)
	(have_image Star10 spectrograph0)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 image1)
	(have_image Planet13 infrared2)
	(have_image Phenomenon14 spectrograph0)
))

)

; plan
1. (turn_to satellite2 star9 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 star9)
   goals met: 0 of 6
2. (switch_on instrument10 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument10)
   goals met: 0 of 6
3. (calibrate satellite2 instrument10 star9)
   added: (calibrated instrument10)
   goals met: 0 of 6
4. (turn_to satellite2 planet12 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 planet12)
   goals met: 0 of 6
5. (take_image satellite2 planet12 instrument10 image1)
   added: (have_image planet12 image1)
   goals met: 1 of 6
6. (turn_to satellite2 planet11 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet11)
   goals met: 1 of 6
7. (take_image satellite2 planet11 instrument10 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 2 of 6
8. (turn_to satellite2 phenomenon14 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon14)
   goals met: 2 of 6
9. (take_image satellite2 phenomenon14 instrument10 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 3 of 6
10. (turn_to satellite1 star0 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star0)
   goals met: 4 of 6
11. (turn_to satellite2 planet13 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 planet13)
   goals met: 4 of 6
12. (take_image satellite2 planet13 instrument10 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 5 of 6
13. (turn_to satellite2 star10 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 star10)
   goals met: 5 of 6
14. (take_image satellite2 star10 instrument10 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 6 of 6
